; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; The child-snack domain 2013
;;
;; This domain is for planning how to make and serve sandwiches for a group of
;; children in which some are allergic to gluten. There are two actions for
;; making sandwiches from their ingredients. The first one makes a sandwich and
;; the second one makes a sandwich taking into account that all ingredients are
;; gluten-free. There are also actions to put a sandwich on a tray, to move a tray
;; from one place to another and to serve sandwiches.
;;
;; Problems in this domain define the ingredients to make sandwiches at the initial
;; state. Goals consist of having all kids served with a sandwich to which they
;; are not allergic.
;;
;; Author: Raquel Fuentetaja and Tomas de la Rosa
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain child-snack)
(:requirements :typing :equality)
(:types kitchen - place
	child bread-portion content-portion sandwich tray place
	)
;(:constants kitchen - place)

(:predicates (at_kitchen_bread ?b - bread-portion)
	     (at_kitchen_content ?c - content-portion)
			 (at_kitchen_sandwich ?s - sandwich)
			 (no_gluten_bread ?b - bread-portion)
       (no_gluten_content ?c - content-portion)
			 (ontray ?s - sandwich ?t - tray)
       (no_gluten_sandwich ?s - sandwich)
	     (allergic_gluten ?c - child)
			 (not_allergic_gluten ?c - child)
	     (served ?c - child)
	     (waiting ?c - child ?p - place)
			 (at ?t - tray ?p - place)
	     (notexist ?s - sandwich)
  )

(:action make_sandwich_no_gluten
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and
		 (at_kitchen_bread ?b)
		 (at_kitchen_content ?c)
		 (no_gluten_bread ?b)
		 (no_gluten_content ?c)
		 (notexist ?s))
	 :effect (and
		 (not (at_kitchen_bread ?b))
		 (not (at_kitchen_content ?c))
		 (at_kitchen_sandwich ?s)
		 (no_gluten_sandwich ?s)
		 (not (notexist ?s)))
)

(:action make_sandwich
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and
		 (at_kitchen_bread ?b)
		 (at_kitchen_content ?c)
		 (notexist ?s))
	 :effect (and
	   (not (at_kitchen_bread ?b))
	   (not (at_kitchen_content ?c))
	   (at_kitchen_sandwich ?s)
		 (not (notexist ?s))
	   )
)

(:action put_on_tray
	 :parameters (?s - sandwich ?t - tray ?k - kitchen)
	 :precondition (and
		 (at_kitchen_sandwich ?s)
		 (at ?t ?k))
	 :effect (and
		 (not (at_kitchen_sandwich ?s))
		 (ontray ?s ?t))
)

(:action serve_sandwich_no_gluten
 	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
     (allergic_gluten ?c)
     (ontray ?s ?t)
     (waiting ?c ?p)
     (no_gluten_sandwich ?s)
		 (at ?t ?p))
	:effect (and
		(not (ontray ?s ?t))
		(served ?c))
)

(:action serve_sandwich
	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
		(not_allergic_gluten ?c)
		(waiting ?c ?p)
		(ontray ?s ?t)
		(at ?t ?p))
	:effect (and
		(not (ontray ?s ?t))
		(served ?c))
)

(:action move_tray
	 :parameters (?t - tray ?p1 ?p2 - place)
	 :precondition (and (at ?t ?p1))
	 :effect (and
		 (not (at ?t ?p1))
		 (at ?t ?p2))
)
)

; problem
(define (problem prob-snack-2)
  (:domain child-snack)
  (:objects
    child1 child2 child3 - child
    bread1 bread2 bread3 - bread-portion
    content1 content2 content3 - content-portion
    tray1 tray2 - tray
    table1 table2 - place
    sandw1 sandw2 sandw3 - sandwich
    kitchen1 - kitchen
  )
  (:init
     (at tray1 kitchen1)
     (at tray2 kitchen1)
     (at_kitchen_bread bread1)
     (at_kitchen_bread bread2)
     (at_kitchen_bread bread3)
     (at_kitchen_content content1)
     (at_kitchen_content content2)
     (at_kitchen_content content3)
     (no_gluten_bread bread2)
     (no_gluten_content content2)
     (allergic_gluten child1)
     (not_allergic_gluten child2)
     (not_allergic_gluten child3)
     (waiting child1 table2)
     (waiting child2 table1)
     (waiting child3 table1)
     (notexist sandw1)
     (notexist sandw2)
     (notexist sandw3)
  )
  (:goal
    (and
     (served child1)
     (served child2)
     (served child3)
    )
  )
)

; plan
1. (make_sandwich_no_gluten sandw3 bread2 content2)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content2) (notexist sandw3)
   added: (at_kitchen_sandwich sandw3) (no_gluten_sandwich sandw3)
   goals met: 0 of 3
2. (put_on_tray sandw3 tray2 kitchen1)
   deleted: (at_kitchen_sandwich sandw3)
   added: (ontray sandw3 tray2)
   goals met: 0 of 3
3. (move_tray tray2 kitchen1 table2)
   deleted: (at tray2 kitchen1)
   added: (at tray2 table2)
   goals met: 0 of 3
4. (serve_sandwich_no_gluten sandw3 child1 tray2 table2)
   deleted: (ontray sandw3 tray2)
   added: (served child1)
   goals met: 1 of 3
5. (make_sandwich sandw2 bread3 content3)
   deleted: (at_kitchen_bread bread3) (at_kitchen_content content3) (notexist sandw2)
   added: (at_kitchen_sandwich sandw2)
   goals met: 1 of 3
6. (put_on_tray sandw2 tray1 kitchen1)
   deleted: (at_kitchen_sandwich sandw2)
   added: (ontray sandw2 tray1)
   goals met: 1 of 3
7. (make_sandwich sandw1 bread1 content1)
   deleted: (at_kitchen_bread bread1) (at_kitchen_content content1) (notexist sandw1)
   added: (at_kitchen_sandwich sandw1)
   goals met: 1 of 3
8. (put_on_tray sandw1 tray1 kitchen1)
   deleted: (at_kitchen_sandwich sandw1)
   added: (ontray sandw1 tray1)
   goals met: 1 of 3
9. (move_tray tray1 kitchen1 table1)
   deleted: (at tray1 kitchen1)
   added: (at tray1 table1)
   goals met: 1 of 3
10. (serve_sandwich sandw1 child2 tray1 table1)
   deleted: (ontray sandw1 tray1)
   added: (served child2)
   goals met: 2 of 3
11. (serve_sandwich sandw2 child3 tray1 table1)
   deleted: (ontray sandw2 tray1)
   added: (served child3)
   goals met: 3 of 3
